/*
 Navicat Premium Data Transfer

 Source Server         : localhost1
 Source Server Type    : MySQL
 Source Server Version : 80011
 Source Host           : localhost
 Source Database       : aolai

 Target Server Type    : MySQL
 Target Server Version : 80011
 File Encoding         : utf-8

 Date: 09/09/2021 14:36:47 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `address`
-- ----------------------------
DROP TABLE IF EXISTS `address`;
CREATE TABLE `address` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `province` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `district` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `isDefault` varchar(255) DEFAULT NULL,
  `userId` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
--  Records of `address`
-- ----------------------------
BEGIN;
INSERT INTO `address` VALUES ('1', '小李', '17611557182', '上海市', '市辖区', '黄浦区', '11号院', '0', '26'), ('2', '张三', '17611557182', '湖南省', '长沙市', '芙蓉区', '26号院', '1', '26'), ('3', '小张123', '17611557182', '江西省', '南昌市', '东湖区', '26号院', '0', '35'), ('8', '小张123', '17611557182', '江西省', '南昌市', '东湖区', '26号院', '1', '35'), ('9', '赵四123', '22323232', '北京市', '市辖区', '海淀区', '1号院', '0', '26');
COMMIT;

-- ----------------------------
--  Table structure for `goods_cart`
-- ----------------------------
DROP TABLE IF EXISTS `goods_cart`;
CREATE TABLE `goods_cart` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uId` int(10) DEFAULT NULL,
  `goods_id` int(10) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `imgUrl` varchar(255) DEFAULT NULL,
  `pprice` varchar(255) DEFAULT NULL,
  `num` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=127 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

-- ----------------------------
--  Records of `goods_cart`
-- ----------------------------
BEGIN;
INSERT INTO `goods_cart` VALUES ('3', '35', '3', '小款衣服', '../../static/img/commodity3.jpg', '59', '1'), ('4', '35', '1', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '../../static/img/commodity1.jpg', '39', '7');
COMMIT;

-- ----------------------------
--  Table structure for `goods_search`
-- ----------------------------
DROP TABLE IF EXISTS `goods_search`;
CREATE TABLE `goods_search` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `imgUrl` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `pprice` varchar(255) DEFAULT NULL,
  `oprice` varchar(255) DEFAULT NULL,
  `discount` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
--  Records of `goods_search`
-- ----------------------------
BEGIN;
INSERT INTO `goods_search` VALUES ('1', '../../static/img/commodity1.jpg', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '1', '499', '8'), ('2', '../../static/img/commodity2.jpg', '大款衣服', '2', '499', '7'), ('3', '../../static/img/commodity3.jpg', '小款衣服', '3', '499', '8'), ('4', '../../static/img/commodity4.jpg', '2020年2月份最新款式大衣', '4', '499', '6');
COMMIT;

-- ----------------------------
--  Table structure for `store_order`
-- ----------------------------
DROP TABLE IF EXISTS `store_order`;
CREATE TABLE `store_order` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uId` varchar(255) DEFAULT NULL,
  `order_id` varchar(255) DEFAULT NULL,
  `goods_name` varchar(255) DEFAULT NULL,
  `goods_price` varchar(255) DEFAULT NULL,
  `goods_num` varchar(255) DEFAULT NULL,
  `order_status` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
--  Records of `store_order`
-- ----------------------------
BEGIN;
INSERT INTO `store_order` VALUES ('19', '26', '20210719144931732446', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买,小款衣服', '294', '6', '2'), ('20', '26', '20210719160038286059', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('21', '26', '2021071916263123592', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('22', '26', '20210719162757846533', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('23', '26', '20210719164345596098', '大款衣服', '138', '2', '2'), ('24', '26', '20210719164502130743', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('25', '26', '20210719164550408172', '小款衣服', '177', '3', '2'), ('26', '26', '20210719164722422041', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('27', '26', '20210719164842847526', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('28', '26', '20210719164944424787', '大款衣服', '69', '1', '2'), ('29', '26', '202107191650316608', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('30', '26', '20210719165108362173', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '117', '3', '2'), ('31', '26', '2021071916542831215', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('32', '26', '20210719223337987729', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('33', '26', '2021071922484833364', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('34', '26', '2021071922501863064', '大款衣服', '69', '1', '2'), ('35', '26', '20210720110505645992', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('36', '26', '20210720110720299979', '', '0', '0', '1'), ('37', '26', '20210720110724270166', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('38', '26', '20210720111231563700', '大款衣服', '69', '1', '2'), ('39', '26', '20210720111329614224', '', '0', '0', '1'), ('40', '26', '20210720111332656890', '大款衣服', '69', '1', '2'), ('41', '26', '20210720111510550011', '2020年2月份最新款式大衣', '99', '1', '2'), ('42', '26', '20210720112034528968', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('43', '26', '20210720112230881760', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('44', '26', '20210720112829926650', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('45', '26', '20210720114106943375', '小款衣服', '59', '1', '2'), ('46', '26', '20210720114409774920', '小款衣服', '59', '1', '2'), ('47', '26', '20210720115731789097', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('48', '26', '20210720115910302887', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('49', '26', '20210720115959577165', '', '0', '0', '1'), ('50', '26', '20210720120002276392', '大款衣服', '69', '1', '2'), ('51', '26', '20210720120106165791', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('52', '26', '20210720120207671765', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('53', '26', '20210720120239737643', '2020年2月份最新款式大衣', '99', '1', '2'), ('54', '26', '20210720120309753779', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('55', '26', '20210720120500854488', '小款衣服', '59', '1', '2'), ('56', '26', '20210720120517147630', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('57', '26', '20210720120547263898', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('58', '26', '20210720120623648698', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('59', '26', '20210720150537903174', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('60', '26', '20210720150845835049', '大款衣服', '69', '1', '1'), ('61', '26', '2021072015104750906', '大款衣服', '138', '2', '2'), ('62', '26', '20210720151316722616', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买,小款衣服', '98', '2', '2'), ('63', '26', '20210720151409420776', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('64', '26', '20210720151458387327', '小款衣服', '59', '1', '2'), ('65', '26', '20210720151533597001', '大款衣服', '69', '1', '2'), ('66', '26', '20210720154551329525', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('67', '26', '20210720154616646735', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '117', '3', '2'), ('68', '26', '20210720155414596988', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '39', '1', '2'), ('69', '26', '20210720160554523335', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('70', '26', '20210720160612619097', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('71', '26', '20210720161052539372', '大款衣服', '69', '1', '2'), ('72', '26', '20210720161857177119', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('73', '26', '20210720161911785198', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '78', '2', '2'), ('74', '26', '20210720162245409690', '大款衣服', '69', '1', '2'), ('75', '26', '20210720162300389154', '', '0', '0', '1'), ('76', '26', '20210720162303686607', '大款衣服', '138', '2', '2'), ('77', '26', '20210720162740924211', '2020年2月份最新款式大衣', '99', '1', '2'), ('78', '26', '20210720171807983252', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '1', '1', '2'), ('79', '26', '20210720171825602319', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '1', '1', '2'), ('80', '26', '20210720171910709367', '', '0', '0', '1'), ('81', '26', '20210720171912165191', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '1', '1', '2'), ('82', '26', '20210720172038144857', '大姨绒毛大款2020年必须买,不买你就不行了,爆款疯狂GG008大姨绒毛大款2020年必须买', '1', '1', '2');
COMMIT;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `userName` varchar(255) DEFAULT NULL,
  `userPwd` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `imgUrl` varchar(255) DEFAULT NULL,
  `nickName` varchar(255) DEFAULT NULL,
  `token` varchar(255) DEFAULT NULL,
  `provider` varchar(255) DEFAULT NULL,
  `openid` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
--  Records of `user`
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES ('26', '', '1234567', '17611557182', '../../static/img/logo.jpg', '默认昵称', 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJuYW1lIjoiMTc2MTE1NTcxODIiLCJpYXQiOjE1ODYyNTEwNDJ9.YB0O06f4FmLZm62kAfMp4wiIDeSUSqio4xwU9fx-Q9A', 'undefined', 'undefined'), ('35', '', '1234567', '15', 'http://qzapp.qlogo.cn/qzapp/1104455702/15DB5F9023ADB1964039C10BAB98BD47/30', '张大腻歪', 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJuYW1lIjoiMTUiLCJpYXQiOjE1ODYyNTc1Mzd9.TMyVueeg8Z2WI34-9QUgIsEIS46e5UwtRqjpdsl1XZU', 'qq', '15DB5F9023ADB1964039C10BAB98BD47'), ('36', '', '1234567', 'oR', 'http://thirdwx.qlogo.cn/mmopen/vi_32/Cic3ibHFHRSWxpfub2R45gDTBr4dGNx5o0EibjN3rwgjXyuXUs3gbmUMeMs3SbUUPCvzmPd1pKnOAZb6aSsTricRRA/132', '张大腻歪', 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJuYW1lIjoib1IiLCJpYXQiOjE1ODYyNzE2MjZ9.FS_iX1_bmhhbwtex5NLN07VeCmbtJvpEmTaMT52zwXk', 'weixin', 'oRrdQt1Yaw1hWF_Vlvg5kQM-GCGg');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
